In [18]:
from pandas import Series, DataFrame
students = {
    'ram': Series({'math':67, 'science':89, 'english': 60, 'nepali':74, 'population': 70}),
    'shyam': Series({'math':50, 'science':69, 'english': 68, 'nepali':80, 'population': 75}),
    'krishna': Series({'math':90, 'science':78, 'english': 80, 'nepali':75, 'population': 84}),
    'radha': Series({'math':82, 'science':74, 'english': 88, 'nepali':85, 'population': 75}),
    'sita': Series({'math':66, 'science':60, 'english': 80, 'nepali':83, 'population': 65}),
}

### Indexing Series

In [103]:
score_ram = students['ram'].copy()

print("math: ", score_ram['math'])

display("math, science, english", score_ram[['math', 'science', 'english']])

display("[1,2,3]", score_ram[[1,2,3]])
display("-2:", score_ram[-2:])

display("'science':'nepali'", score_ram['science':'nepali'])

display("1:4", score_ram[1:4])

display("score>70", score_ram[score_ram>70])

score_ram['science':'nepali'] = 98
display( score_ram)

math:  67

'math, science, english'

math       67
science    89
english    60
dtype: int64

'[1,2,3]'

science    89
english    60
nepali     74
dtype: int64

'-2'

nepali        74
population    70
dtype: int64

"'science':'nepali'"

science    89
english    60
nepali     74
dtype: int64

'1:4'

science    89
english    60
nepali     74
dtype: int64

'score>70'

science    89
nepali     74
dtype: int64

math          67
science       98
english       98
nepali        98
population    70
dtype: int64

### Integer indexing

In [113]:
display(score_ram[-2]) ## This integer indexing will work because labels in score_ram are string
int_index_series = Series(list('abcdefgh'))
display(int_index_series[2])
display(int_index_series[-2]) ## this will fail because it is ambigious if user wants integer indexing or label indexing as both are integer

98

'c'

KeyError: -2

### Indexing Dataframes
- for slicing using index, both columns and index must be monotonus

In [106]:
df_students = DataFrame(students)
df_students.columns = df_students.columns.sort_values()
df_students.index = df_students.index.sort_values()
display(df_students)
display('ram', df_students['ram'])
display('ram, radha', df_students[['ram', 'radha']])

            krishna  radha  ram  shyam  sita
english          67     50   90     82    66
math             89     69   78     74    60
nepali           60     68   80     88    80
population       74     80   75     85    83
science          70     75   84     75    65

'ram'

english       90
math          78
nepali        80
population    75
science       84
Name: ram, dtype: int64

'ram, radha'

            ram  radha
english      90     50
math         78     69
nepali       80     68
population   75     80
science      84     75

In [65]:
## boolean indexing
display("score['radha']>70", df_students[df_students['radha']>70])
display("score>70", df_students[df_students>70])

"score['radha']>70"

            krishna  radha  ram  shyam  sita
population       74     80   75     85    83
science          70     75   84     75    65

'score>70'

            krishna  radha  ram  shyam  sita
english         NaN    NaN   90     82   NaN
math           89.0    NaN   78     74   NaN
nepali          NaN    NaN   80     88  80.0
population     74.0   80.0   75     85  83.0
science         NaN   75.0   84     75   NaN

### Row Slicing
- Slicing syntax selects rows

In [73]:
## row slicing using integer range 
display(df_students[3:])
## row slicing using row index
display("'math':'nepal'", df_students['math':'nepali'])
## row slicing using row index
display("'m':'s'", df_students['m':'s'])

            krishna  radha  ram  shyam  sita
population       74     80   75     85    83
science          70     75   84     75    65

"'math':'nepal'"

        krishna  radha  ram  shyam  sita
math         89     69   78     74    60
nepali       60     68   80     88    80

"'m':'s'"

            krishna  radha  ram  shyam  sita
math             89     69   78     74    60
nepali           60     68   80     88    80
population       74     80   75     85    83

### Row Indexing
- loc: indexing by label
- iloc: indexing by integer index

In [100]:
display('math', df_students.loc['math'])
display("math, science, english",df_students.loc[['math', 'science', 'english']])
display("[math, science, english],[radha, ram]",df_students.loc[['math', 'science', 'english'], ['radha', 'ram']])

display("[:'p', 'r':]", df_students.loc[:'p', 'r':]) ## rows upto 'p' and columns for 'r' and above

display("[1:4, 2:]", df_students.iloc[:, 2:])
display("[1:4, 2:][df_students.sita>70]", df_students.iloc[:, 2:][df_students.sita>70]) ## all rows, columns 2 and above and rows 
                                                                ## where sita's score is greater than 70

'math'

krishna    89
radha      69
ram        78
shyam      74
sita       60
Name: math, dtype: int64

'math, science, english'

         krishna  radha  ram  shyam  sita
math          89     69   78     74    60
science       70     75   84     75    65
english       67     50   90     82    66

'[math, science, english],[radha, ram]'

         radha  ram
math        69   78
science     75   84
english     50   90

"[:'p', 'r':]"

         radha  ram  shyam  sita
english     50   90     82    66
math        69   78     74    60
nepali      68   80     88    80

'[1:4, 2:]'

            ram  shyam  sita
english      90     82    66
math         78     74    60
nepali       80     88    80
population   75     85    83
science      84     75    65

'[1:4, 2:][df_students.sita>70]'

            ram  shyam  sita
nepali       80     88    80
population   75     85    83